# brew deps --tree xx
# brew leaves | xargs brew desc --eval-all

tap "homebrew/bundle"
brew "git"
brew "awscli"
brew "diff-so-fancy"
brew "expect"
brew "node"
brew "gnu-sed"
brew "pdfgrep"
brew "python"
brew "rsync"
brew "mas"
brew "fnm"
brew "fzf"
brew "grep"
brew "htop"
brew "jq"
brew "just"
brew "mysql-client"
brew "php"
brew "pyenv"
brew "pyenv-virtualenv"
brew "mysides" # OSX Finder Favourites
brew "pygments"
brew "rbenv"
brew "shellcheck"
brew "telnet"
brew "tmux"
brew "watchman"
brew "wget"
brew "yarn"
brew "keyboard-maestro"
brew "lunar"
brew "whichspace"
brew "logi-options+"
brew "bash-completion"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

cask "font-hack"
cask "font-nunito-sans"
cask "docker"
cask "dropbox"
cask "slack"
cask "1password"
cask "alacritty"
cask "firefox"
cask "loom"
cask "alfred"
cask "anki"
cask "arc"
cask "audacity"
cask "fantastical"
cask "google-chrome"
cask "istat-menus@6"
cask "notion"
cask "todoist"
cask "obsidian"
cask "visual-studio-code"
cask "vlc"
cask "zotero"
cask "whatsapp"
cask "zoom"
cask "daisydisk"
cask "spotify"
cask "postico"
cask "postman"
cask "karabiner-elements"
