# brew deps --tree xx
# brew leaves | xargs brew desc --eval-all

tap "homebrew/bundle"

###############################################################
# Development Tools
###############################################################
# Editors
cask "visual-studio-code" # code editor
cask "cursor" # code editor
# Languages
brew "node" # javascript runtime
brew "php" # php
brew "pyenv-virtualenv" # python virtual environment
brew "pyenv" # python version manager
brew "python"
brew "rbenv" # ruby version manager
brew "shellcheck" # shell script linter
brew "watchman" # file watcher
brew "yarn" # javascript package manager
brew "mysql-client" # mysql client
brew "libpq" # postgres client
brew "fnm" # fast node manager
# Other
brew "awscli" # aws cli
brew "bash-completion"
cask "docker" # containerization
brew "git" # version control
brew "jq" # json parser
brew "just" # task runner
brew "shellcheck" # shell script linter
brew "watchman" # file watcher
cask "postico" # postgres client
cask "postman" # api client
cask "alacritty" # after brew install, go to security and allow alacritty
brew "diff-so-fancy" # git diff formatter
brew "git-delta" # git diff formatter

###############################################################
# Colors
###############################################################
brew "pygments" # syntax highlighting
brew "grc" # Generic Colouriser e.g. grc ping google.com
# brew "colorize" # installed via gem - Adds colour to text in general (stdin, files, etc.)

###############################################################
# System Utilities
###############################################################
brew "fzf" #
brew "zsh-autosuggestions" # ghost autocompletion
brew "zsh-syntax-highlighting" # zsh syntax highlighting
brew "gnu-sed" # sed
brew "grep" # grep
brew "htop" # system monitor
brew "mas" # mac app store
brew "pdfgrep" # pdf search
brew "rsync" # file transfer
brew "telnet" # telnet
brew "tmux" # terminal multiplexer
brew "wget" # wget
brew "tilt" # dev automator
cask "istat-menus@6" # system monitor
cask "lunar" # screen brightness
cask "daisydisk" # disk space analyzer
cask "karabiner-elements" # keyboard remapper
brew "ghostscript" # pdf viewer, ps2pdf
# brew "keyboard-maestro" # macro recorder
# brew "koekeishiya/formulae/skhd" # hotkey daemon
# brew "koekeishiya/formulae/yabai" # window manager
cask "mysides" # OSX Finder Favourites https://github.com/mosen/mysides

###############################################################
# Productivity
###############################################################
cask "obsidian" # note taking
cask "notion" # note taking
cask "todoist" # todo list
cask "fantastical" # calendar
cask "1password" # password manager
cask "logi-options+" # logitech mouse
cask "alfred" # search
cask "bartender" # hide menu bar icons
cask "dropbox" # cloud storage

###############################################################
# Collaboration
###############################################################
cask "loom" # screen recording
cask "slack" # messaging
cask "whatsapp" # messaging
# cask "zoom" # video conferencing

###############################################################
# Browsers
###############################################################
cask "firefox" # browser
cask "google-chrome" # browser
cask "arc" # browser

###############################################################
# Media
###############################################################
cask "audacity" # audio editor
cask "spotify" # music
cask "vlc" # video player

###############################################################
# Learning
###############################################################
cask "anki" # flashcards
cask "zotero" # reference manager
cask "chatgpt" # ai chatbot

###############################################################
# Fonts
###############################################################
cask "font-hack-nerd-font" # alacritty font
cask "font-hack" # terminal font
cask "font-nunito-sans" # sans-serif font
