# brew deps --tree xx
# brew leaves | xargs brew desc --eval-all

tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "awscli"
brew "pygments"
brew "grc" # https://github.com/garabik/grc
brew "awscli-local"
brew "shellcheck"
brew "diff-so-fancy"
brew "expect"
brew "fnm"
brew "fzf"
brew "gradle"
brew "grep"
brew "htop"
brew "jq"
brew "just"
brew "maven"
brew "mysql-client"
brew "neovim"
brew "openjdk@17"
brew "pyenv"
brew "pyenv-virtualenv"
brew "telnet"
brew "tmux"
brew "watchman"
brew "wget"
brew "yarn"
